Конфигурация/Documents/СделкаСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СделкаСНедвижимостью</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ГрафикиПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расторжение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПраваНаНедвижимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравНаНедвижимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Срок</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СделкаСНедвижимостью/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки(ОсновнаяСделкаСНедвижимостью)

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;	
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияСделокСНедвижимостью");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", 					ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",               ОсновнаяСделкаСНедвижимостью);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ГрафикиПлатежей");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", 					ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",               ОсновнаяСделкаСНедвижимостью);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки()

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.ГрафикиПлатежей.Записывать = Истина;
	Движения.ГрафикиПлатежей.Записать();
	Движения.УсловияСделокСНедвижимостью.Записывать = Истина;
	Движения.УсловияСделокСНедвижимостью.Записать();
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	ОсновнаяСделкаСНедвижимостью = ?(ЗначениеЗаполнено(ЭтотОбъект.Основание), ЭтотОбъект.Основание, ЭтотОбъект.Ссылка);
	
	УстановитьБлокировки(ОсновнаяСделкаСНедвижимостью);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL
		|			ТОГДА УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости
		|		ИНАЧЕ СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости
		|	КОНЕЦ КАК ОбъектНедвижимости,
		|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС,
		|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.СуммаНДС, 0) КАК СуммаНДС,
		|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.Срок, ДАТАВРЕМЯ(1, 1, 1)) КАК Срок,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Отменено КАК ОтмененоПрежняя,
		|	СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL КАК Отменено,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи, ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.)) КАК АктПриемаПередачи,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности, ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.)) КАК СведенияОГосРегистрацииПраваСобственности
		|ИЗ
		|	(ВЫБРАТЬ
		|		СделкаСНедвижимостьюОбъектыНедвижимости.Ссылка КАК Ссылка,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.НомерСтроки КАК НомерСтроки,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.Сумма КАК Сумма,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.СтавкаНДС КАК СтавкаНДС,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.СуммаНДС КАК СуммаНДС,
		|		СделкаСНедвижимостьюОбъектыНедвижимости.Срок КАК Срок
		|	ИЗ
		|		Документ.СделкаСНедвижимостью.ОбъектыНедвижимости КАК СделкаСНедвижимостьюОбъектыНедвижимости
		|	ГДЕ
		|		СделкаСНедвижимостьюОбъектыНедвижимости.Ссылка = &Ссылка) КАК СделкаСНедвижимостьюОбъектыНедвижимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|			УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи,
		|			УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма,
		|			УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи КАК АктПриемаПередачи,
		|			УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности КАК СведенияОГосРегистрацииПраваСобственности,
		|			УсловияСделокСНедвижимостьюСрезПоследних.Отменено КАК Отменено
		|		ИЗ
		|			РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|					&Момент,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ГДЕ
		|			НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости";
	
	Запрос.УстановитьПараметр("Момент", ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание", ОсновнаяСделкаСНедвижимостью);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписьУсловий = Движения.УсловияСделокСНедвижимостью.Добавить();
		ЗаписьУсловий.Период = Дата;
		ЗаписьУсловий.Организация = Организация;
		ЗаписьУсловий.СчетДоверительногоУправления = СчетДоверительногоУправления;
		ЗаписьУсловий.Основание = ОсновнаяСделкаСНедвижимостью;
		ЗаписьУсловий.ОбъектНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
		ЗаписьУсловий.АктПриемаПередачи = ВыборкаДетальныеЗаписи.АктПриемаПередачи;
		ЗаписьУсловий.СведенияОГосРегистрацииПраваСобственности = ВыборкаДетальныеЗаписи.СведенияОГосРегистрацииПраваСобственности;
		ЗаписьУсловий.ПлановаяДатаПередачи = ВыборкаДетальныеЗаписи.Срок;
		ЗаписьУсловий.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		ЗаписьУсловий.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
		ЗаписьУсловий.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС;
		ЗаписьУсловий.Отменено = ВыборкаДетальныеЗаписи.Отменено;
	КонецЦикла;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты ЕСТЬ NULL
		|			ТОГДА ГрафикиПлатежейСрезПоследних.ДатаПлатежа
		|		ИНАЧЕ СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты
		|	КОНЕЦ КАК ПлановаяДатаОплаты,
		|	ВЫБОР
		|		КОГДА СделкаСНедвижимостьюГрафикПлатежей.Сумма ЕСТЬ NULL
		|			ТОГДА ГрафикиПлатежейСрезПоследних.Сумма
		|		ИНАЧЕ СделкаСНедвижимостьюГрафикПлатежей.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ЕСТЬNULL(СделкаСНедвижимостьюГрафикПлатежей.Сумма, 0) - ЕСТЬNULL(ГрафикиПлатежейСрезПоследних.Сумма, 0) КАК ДельтаПоСумме,
		|	НЕ СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты ЕСТЬ NULL КАК Действует
		|ИЗ
		|	(ВЫБРАТЬ
		|		СделкаСНедвижимостьюГрафикПлатежей.Ссылка КАК Ссылка,
		|		СделкаСНедвижимостьюГрафикПлатежей.НомерСтроки КАК НомерСтроки,
		|		СделкаСНедвижимостьюГрафикПлатежей.Сумма КАК Сумма,
		|		СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты
		|	ИЗ
		|		Документ.СделкаСНедвижимостью.ГрафикПлатежей КАК СделкаСНедвижимостьюГрафикПлатежей
		|	ГДЕ
		|		СделкаСНедвижимостьюГрафикПлатежей.Ссылка = &Ссылка) КАК СделкаСНедвижимостьюГрафикПлатежей
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГрафикиПлатежейСрезПоследних.Основание КАК Основание,
		|			ГрафикиПлатежейСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
		|			ГрафикиПлатежейСрезПоследних.Сумма КАК Сумма,
		|			ГрафикиПлатежейСрезПоследних.Действует КАК Действует
		|		ИЗ
		|			РегистрСведений.ГрафикиПлатежей.СрезПоследних(
		|					&Момент,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И Основание = &Основание) КАК ГрафикиПлатежейСрезПоследних
		|		ГДЕ
		|			ГрафикиПлатежейСрезПоследних.Действует) КАК ГрафикиПлатежейСрезПоследних
		|		ПО СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты = ГрафикиПлатежейСрезПоследних.ДатаПлатежа
		|ГДЕ
		|	(СделкаСНедвижимостьюГрафикПлатежей.ПлановаяДатаОплаты ЕСТЬ NULL
		|			ИЛИ ГрафикиПлатежейСрезПоследних.ДатаПлатежа ЕСТЬ NULL
		|			ИЛИ ЕСТЬNULL(СделкаСНедвижимостьюГрафикПлатежей.Сумма, 0) <> ЕСТЬNULL(ГрафикиПлатежейСрезПоследних.Сумма, 0))";
	
	Запрос.УстановитьПараметр("Момент", ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание", ОсновнаяСделкаСНедвижимостью);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаСделкиДельта = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписьГрафика = Движения.ГрафикиПлатежей.Добавить();
		ЗаписьГрафика.Период = Дата;
		ЗаписьГрафика.Организация = Организация;
		ЗаписьГрафика.СчетДоверительногоУправления = СчетДоверительногоУправления;
		ЗаписьГрафика.Основание = ОсновнаяСделкаСНедвижимостью;
		ЗаписьГрафика.ДатаПлатежа = ВыборкаДетальныеЗаписи.ПлановаяДатаОплаты;
		ЗаписьГрафика.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		ЗаписьГрафика.Действует = ВыборкаДетальныеЗаписи.Действует;
		
		СуммаСделкиДельта = СуммаСделкиДельта + ВыборкаДетальныеЗаписи.ДельтаПоСумме;
	КонецЦикла;
	
	Если СуммаСделкиДельта <> 0 Тогда
		
		ЗаписьЗадолженности = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		ЗаписьЗадолженности.Период = Дата;
		ЗаписьЗадолженности.Организация = Организация;
		ЗаписьЗадолженности.СчетДоверительногоУправления = СчетДоверительногоУправления;
		ЗаписьЗадолженности.Основание = ОсновнаяСделкаСНедвижимостью;
		ЗаписьЗадолженности.ТипЗадолженности = ?(ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка, Перечисления.ТипыЗадолженности.Кредиторская, Перечисления.ТипыЗадолженности.Дебиторская);
		ЗаписьЗадолженности.ВидЗадолженности = Документы.СделкаСНедвижимостью.ПолучитьВидЗадолженности(ЭтотОбъект.ВидПраваНаНедвижимость, ЭтотОбъект.ВидСделки, Отказ);
		ЗаписьЗадолженности.Валюта = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
		ЗаписьЗадолженности.Контрагент = ЭтотОбъект.Контрагент;
		ЗаписьЗадолженности.Аванс = Ложь;
		ЗаписьЗадолженности.Сумма = СуммаСделкиДельта;
		ЗаписьЗадолженности.СуммаКупона = 0;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ
		ИЛИ ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт 
		ИЛИ ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
			И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка
		Тогда
		
		ВидУчета = Перечисления.ВидыУчета[УчетныйРегистр];
		
		ВидЗадолженности = Документы.СделкаСНедвижимостью.ПолучитьВидЗадолженности(ЭтотОбъект.ВидПраваНаНедвижимость, ЭтотОбъект.ВидСделки, Отказ);
		
		Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
			СчетУчетаРасчетов = ПланыСчетов.Основной.РасчетыСКонтрагентами; 
		Иначе
			СчетУчетаРасчетов = ПланыСчетов.Основной.РасчетыСЗастройщикамиИАрендодателями; 
		КонецЕсли;	

		
		УчетныйАктив = Документы.СделкаСНедвижимостью.ПолучитьУчетныйАктив(ЭтотОбъект.ВидПраваНаНедвижимость, ЭтотОбъект.ВидСделки, Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		НастройкиУчетаПрава = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, УчетныйАктив, ВидУчета);
		
		Если НЕ ЗначениеЗаполнено(НастройкиУчетаПрава.СчетУчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен счет учета для актива " + УчетныйАктив, ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НастройкиУчетаПрава.СчетУчетаПереоценки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен счет учета переоценки для актива " + УчетныйАктив, ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		АналитикаПрочие = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ВидыЗадолженности.Прочее, ВидУчета, "Аналитика",Истина);
		
		ПереоцениватьПриобретенныеАктивы = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, УчетныйРегистр, "ПереоцениватьПриобретенныеАктивы");
		
		НастройкиЦелейРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.БухгалтерскийУчет);
		
		АналитикаПоВидуЗадолженности = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ВидЗадолженности, ВидУчета, "Аналитика",Истина);
		СчетПереоценкиПоВидуЗадолженности = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ВидЗадолженности, ВидУчета, "СчетУчетаПереоценки",Истина);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА НЕ БухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
			|			ТОГДА БухгалтерскийУчетОстатки.Субконто3
			|		ИНАЧЕ СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости
			|	КОНЕЦ КАК ОбъектНедвижимости,
			|	ВЫБОР
			|		КОГДА СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL
			|			ТОГДА ЕСТЬNULL(БухгалтерскийУчетОстаткиПереоценка.СуммаОстаток, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОстатокПереоценки,
			|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.Сумма, 0) - ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстатокДт, 0) КАК Дельта,
			|	ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0) КАК Стоимость,
			|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.Сумма, 0) КАК Сумма,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость ЕСТЬ НЕ NULL  КАК ЕстьОценка,
			|	НЕ БухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
			|			И СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL
			|		ИЛИ БухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
			|			И НЕ СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости ЕСТЬ NULL КАК ЭтоЗаменаОбъекта
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&МоментДоДокумента,
			|			Счет = &Счет,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Субконто1 = &Контрагент
			|				И Субконто2 = &Договор) КАК БухгалтерскийУчетОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|				&МоментДоДокумента,
			|				Счет = &СчетПереоценки,
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Субконто1 = &Контрагент
			|					И Субконто2 = &Договор) КАК БухгалтерскийУчетОстаткиПереоценка
			|		ПО БухгалтерскийУчетОстатки.Субконто3 = БухгалтерскийУчетОстаткиПереоценка.Субконто3
			|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|			СделкаСНедвижимостьюОбъектыНедвижимости.Сумма КАК Сумма
			|		ИЗ
			|			Документ.СделкаСНедвижимостью.ОбъектыНедвижимости КАК СделкаСНедвижимостьюОбъектыНедвижимости
			|		ГДЕ
			|			СделкаСНедвижимостьюОбъектыНедвижимости.Ссылка = &Ссылка) КАК СделкаСНедвижимостьюОбъектыНедвижимости
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
			|					&МоментДоДокумента,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И Основание = &Основание
			|						И СубъектАналитики В
			|							(ВЫБРАТЬ
			|								СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
			|							ИЗ
			|								Документ.СделкаСНедвижимостью.ОбъектыНедвижимости КАК СделкаСНедвижимостьюОбъектыНедвижимости
			|							ГДЕ
			|								СделкаСНедвижимостьюОбъектыНедвижимости.Ссылка = &Основание)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
			|			ПО СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
			|				И (ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия > НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ))
			|		ПО БухгалтерскийУчетОстатки.Субконто3 = СделкаСНедвижимостьюОбъектыНедвижимости.ОбъектНедвижимости
			|ГДЕ
			|	ЕСТЬNULL(СделкаСНедвижимостьюОбъектыНедвижимости.Сумма, 0) - ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстатокДт, 0) <> 0";
		
		Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);
		Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
		Запрос.УстановитьПараметр("МоментДоДокумента", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Основание", ?(ЭтотОбъект.Изменение, ЭтотОбъект.Основание, ЭтотОбъект.Ссылка));
		Запрос.УстановитьПараметр("Счет", НастройкиУчетаПрава.СчетУчета);
		Запрос.УстановитьПараметр("СчетПереоценки", НастройкиУчетаПрава.СчетУчетаПереоценки);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
				И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Изменение Тогда
				
				Если ВыборкаДетальныеЗаписи.ЭтоЗаменаОбъекта Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Замена объекта по аренде " + Ссылка
						+ " не отработана! Проводки не сформированы! Обратитесь к программистам.", Ссылка,,, Отказ);
					Возврат;
				КонецЕсли;
					
			Иначе
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(ВыборкаДетальныеЗаписи.Дельта), "Признание прав и обязательств ");
				
				Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
					ЕстьСубконтоОбъектыНедвижимостиСчетУчета = Ложь;
				Иначе
					ЕстьСубконтоОбъектыНедвижимостиСчетУчета = Истина;
				КонецЕсли;	
			
				Если ВыборкаДетальныеЗаписи.Дельта > 0 Тогда
					
					Проводка.СчетДт = НастройкиУчетаПрава.СчетУчета;
					Если ЕстьСубконтоОбъектыНедвижимостиСчетУчета Тогда
						Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					КонецЕсли;	
					
					Проводка.СчетКт = СчетУчетаРасчетов;
					
				Иначе
					
					Проводка.СчетДт = СчетУчетаРасчетов;
					
					Проводка.СчетКт = НастройкиУчетаПрава.СчетУчета;
					Если ЕстьСубконтоОбъектыНедвижимостиСчетУчета Тогда
						Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					КонецЕсли;	
					
				КонецЕсли;
				
				ЕстьСубконтоДтКонтрагенты = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
				ЕстьСубконтоДтДоговоры = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
				
				Если ЕстьСубконтоДтКонтрагенты Тогда
					Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
				КонецЕсли;	
				Если ЕстьСубконтоДтДоговоры Тогда
					Проводка.СубконтоДт.Договоры = ЭтотОбъект.Договор;
				КонецЕсли;	
				
				ЕстьСубконтоКтКонтрагенты = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
				ЕстьСубконтоКтДоговоры = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
				
				Если ЕстьСубконтоКтКонтрагенты Тогда
					Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
				КонецЕсли;
				Если ЕстьСубконтоКтДоговоры Тогда 
					Проводка.СубконтоКт.Договоры = ЭтотОбъект.Договор;
				КонецЕсли;	
				
				Если ВыборкаДетальныеЗаписи.ОстатокПереоценки <> 0 Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(ВыборкаДетальныеЗаписи.ОстатокПереоценки), "Признание прав и обязательств ");
					
					Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
						ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки = Ложь;
					Иначе
						ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки = Истина;
					КонецЕсли;	
					
			
					Если ВыборкаДетальныеЗаписи.ОстатокПереоценки > 0 Тогда
						
						Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
						Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаПрава.АналитикаДоходовОтРеализации;
						Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Договор;
						
						Проводка.СчетКт = НастройкиУчетаПрава.СчетУчетаПереоценки;
						
						ЕстьСубконтоКтКонтрагенты = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
						ЕстьСубконтоКтДоговоры = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
						
						Если ЕстьСубконтоКтКонтрагенты Тогда
							Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
						КонецЕсли;	
						Если ЕстьСубконтоКтДоговоры Тогда
							Проводка.СубконтоКт.Договоры = ЭтотОбъект.Договор;
						КонецЕсли;	
						Если ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки Тогда
							Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						КонецЕсли;	
						
					Иначе
						
						Проводка.СчетДт = НастройкиУчетаПрава.СчетУчетаПереоценки;
						
						ЕстьСубконтоДтКонтрагенты = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
						ЕстьСубконтоДтДоговоры = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
						
						Если ЕстьСубконтоДтКонтрагенты Тогда
							Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
						КонецЕсли;	
						Если ЕстьСубконтоДтДоговоры Тогда
							Проводка.СубконтоДт.Договоры = ЭтотОбъект.Договор;
						КонецЕсли;	
						Если ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки Тогда
							Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						КонецЕсли;	
						
						Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
						Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаПрава.АналитикаДоходовОтРеализации;
						Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Договор;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//переоценка первоначального признания права (имущественного или аренды)
			Если Не ЭтотОбъект.Изменение И НастройкиУчетаПрава.ПереоцениватьВДеньОперации И ВыборкаДетальныеЗаписи.ЕстьОценка Тогда
				
				СуммаПереоценки = ВыборкаДетальныеЗаписи.Стоимость - ВыборкаДетальныеЗаписи.Сумма;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(СуммаПереоценки), "Переоценка первоначального признания прав");
				
				Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
					ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки = Ложь;
				Иначе
					ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки = Истина;
				КонецЕсли;	
				
				Если СуммаПереоценки > 0 Тогда
					
					Проводка.СчетДт = НастройкиУчетаПрава.СчетУчетаПереоценки;
					
					ЕстьСубконтоДтКонтрагенты = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
					ЕстьСубконтоДтДоговоры = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
					ЕстьСубконтоДтОснованиеРасчетов = (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
					
					Если ЕстьСубконтоДтКонтрагенты Тогда
						Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
					КонецЕсли;	
					Если ЕстьСубконтоДтДоговоры Тогда
						Проводка.СубконтоДт.Договоры = ЭтотОбъект.Договор;
					КонецЕсли;	
					Если ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки Тогда
						Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					КонецЕсли;	
					Если ЕстьСубконтоДтОснованиеРасчетов Тогда
						Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					КонецЕсли;	
					
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаПрава.АналитикаДоходовОтРеализации;
					Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Договор;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаПрава.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Договор;
					
					Проводка.СчетКт = НастройкиУчетаПрава.СчетУчетаПереоценки;
					
					ЕстьСубконтоКтКонтрагенты = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
					ЕстьСубконтоКтДоговоры = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
					ЕстьСубконтоКтОснованиеРасчетов = (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
					
					Если ЕстьСубконтоКтКонтрагенты Тогда
						Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
					КонецЕсли;
					Если ЕстьСубконтоКтДоговоры Тогда 
						Проводка.СубконтоКт.Договоры = ЭтотОбъект.Договор;
					КонецЕсли;	
					Если ЕстьСубконтоОбъектыНедвижимостиСчетУчетаПереоценки Тогда
						Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					КонецЕсли;	
					Если ЕстьСубконтоКтОснованиеРасчетов Тогда
						Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если Не Отказ И ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
			И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка И ЭтотОбъект.Изменение Тогда
			
			Выплаты = Документы.СделкаСНедвижимостью.ПолучитьПлановыеВыплатыПоСделкеСНедвижимостью(?(ЭтотОбъект.Изменение, ЭтотОбъект.Основание, ЭтотОбъект.Ссылка), ЭтотОбъект.Дата);
			НоваяЗадолженностьПоБэку = Выплаты.Итог("Сумма");
			ОстатокЗадолженностиПоБУ = 0;
				
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&МоментДоДокумента,
				|			Счет = &СчетРасчетов,
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И Субконто1 = &Контрагент
				|				И Субконто2 = &Договор) КАК БухгалтерскийУчетОстатки";
			
			Запрос.УстановитьПараметр("СчетРасчетов", СчетУчетаРасчетов);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОстатокЗадолженностиПоБУ = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
			КонецЦикла;
			
			Дельта = НоваяЗадолженностьПоБэку - ОстатокЗадолженностиПоБУ;
			
			//проводки при изменении
			Если Дельта > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(Дельта), "Изменение суммы договора аренды");
			
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				//при изменении кадастровой стоимости - прочие, при изменении условий договора нужна другая аналитика. Пока не фиксируется причина изменения.
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПрочие;
				Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Договор;
				
				Проводка.СчетКт = СчетУчетаРасчетов;
				Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
				Проводка.СубконтоКт.Договоры = ЭтотОбъект.Договор;
				
			Иначе
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(Дельта), "Изменение суммы договора аренды");
			
				Проводка.СчетДт = СчетУчетаРасчетов;
				Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
				Проводка.СубконтоДт.Договоры = ЭтотОбъект.Договор;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПрочие;
				Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Договор;
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если ПереоцениватьПриобретенныеАктивы И НЕ ЭтотОбъект.Изменение Тогда
			
			Параметры = Новый Структура;
			Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			Параметры.Вставить("Период", ЭтотОбъект.Дата);
			Параметры.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиЦелейРасчета.ВариантРасчетаОценочнойСтоимости);
			Параметры.Вставить("Организация", ЭтотОбъект.Организация);
			Параметры.Вставить("ЦельРасчета", Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
			
			ЗадолженностиКОбесценениюИДисконтированию = РаботаСоСтоимостьюПоРыночнойСтавке.РассчитатьСправедливыеСтоимостиЗадолженностей(
				Параметры, 
				Неопределено,
				Отказ);
				
			СтрокаЗадолженности = ЗадолженностиКОбесценениюИДисконтированию.Найти(Ссылка, "ОснованиеЗадолженности");
			
			Если СтрокаЗадолженности <> Неопределено 
				И СтрокаЗадолженности.ПроцентыЭСП <> 0 
				И СтрокаЗадолженности.ВидЗадолженности = ВидЗадолженности Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(СтрокаЗадолженности.ПроцентыЭСП), "Переоценка первоначального признания задолженности");
				
				Если СтрокаЗадолженности.ПроцентыЭСП < 0 Тогда
					
					Проводка.СчетДт = СчетПереоценкиПоВидуЗадолженности;
					Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПоВидуЗадолженности;
					Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Договор;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПоВидуЗадолженности;
					Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Договор;
					
					Проводка.СчетКт = СчетПереоценкиПоВидуЗадолженности;
					Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
					Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.Изменение = Истина;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Основание) Тогда
			ЭтотОбъект.Основание = ДанныеЗаполнения.Основание;
		Иначе
			ЭтотОбъект.Основание = ДанныеЗаполнения;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма,
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК Срок,
			|	УсловияСделокСНедвижимостьюСрезПоследних.СтавкаНДС КАК СтавкаНДС,
			|	УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(, Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено";
		
		Запрос.УстановитьПараметр("Основание", Основание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ЭтотОбъект.ОбъектыНедвижимости.Загрузить(РезультатЗапроса.Выгрузить());
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГрафикиПлатежейСрезПоследних.Сумма КАК Сумма,
			|	ГрафикиПлатежейСрезПоследних.ДатаПлатежа КАК ПлановаяДатаОплаты
			|ИЗ
			|	РегистрСведений.ГрафикиПлатежей.СрезПоследних(, Основание = &Основание) КАК ГрафикиПлатежейСрезПоследних
			|ГДЕ
			|	ГрафикиПлатежейСрезПоследних.Действует";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ЭтотОбъект.ГрафикПлатежей.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		//проверка соответствия вида договора, вида сделки и вида права на недвижимость
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
			Если ЭтотОбъект.Дата > Дата(2021,1,1) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан договор " + ЭтотОбъект.ВидПраваНаНедвижимость, ЭтотОбъект, "Договор", ,Отказ);
			КонецЕсли;
		Иначе
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				Если НЕ (ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность 
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Договор,"ВидДоговора") = Перечисления.ВидыДоговоров.ДоговорКуплиПродажи) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимое сочетание вида договора и права на недвижимость при продаже " +ЭтотОбъект.ВидПраваНаНедвижимость,ЭтотОбъект, "ВидПраваНаНедвижимость", ,Отказ);
				КонецЕсли;
			Иначе
				Если НЕ ( (ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность 
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Договор,"ВидДоговора") = Перечисления.ВидыДоговоров.ДоговорКуплиПродажи)
					ИЛИ (ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ 
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Договор,"ВидДоговора") = Перечисления.ВидыДоговоров.ДДУ)
					ИЛИ (ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда 
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Договор,"ВидДоговора") = Перечисления.ВидыДоговоров.Аренды)
					ИЛИ (ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт 
						И Справочники.Договоры.ЭтоИнвестконтракт(ЭтотОбъект.Договор))) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимое сочетание вида договора и права на недвижимость при покупке " +ЭтотОбъект.ВидПраваНаНедвижимость,ЭтотОбъект, "ВидПраваНаНедвижимость", ,Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.ОбъектыНедвижимости.Итог("Сумма") <> ЭтотОбъект.ГрафикПлатежей.Итог("Сумма") 
			И ЭтотОбъект.Дата > Дата(2021,1,1) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма графика платежей не совпадает с суммой сделки!",ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
		//дата передачи объекта
		Для каждого СтрокаОбъекта из ЭтотОбъект.ОбъектыНедвижимости Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаОбъекта.Срок) И НЕ ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаОбъекта.НомерСтроки + " не заполнен срок передачи объекта " + СтрокаОбъекта.ОбъектНедвижимости, ЭтотОбъект,"ОбъектыНедвижимости["+(СтрокаОбъекта.НомерСтроки - 1)+"].Срок",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		//Для аренды проверим, что заполнена дата окончания договора в условиях.
		Если ЗначениеЗаполнено(ЭтотОбъект.Договор) 
			И ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда 
			И ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторжения
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(
				|				&Период,
				|				Договор = &Договор
				|					И Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
				|		ПО УсловияДоговоровОбщиеСрезПоследних.Договор = Договоры.Ссылка
				|ГДЕ
				|	Договоры.Ссылка = &Договор";
			
			Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаРасторжения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для договора долгосрочной аренды необходимо указать срок окончания", ЭтотОбъект.Договор,,, Отказ);
			КонецЕсли;
	
		КонецЕсли;
		
		//здание - только для ДДУ
		Если ЭтотОбъект.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Здание) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ДДУ необходимо указать здание", ЭтотОбъект, "Здание",, Отказ);
			Иначе
				
				//а это здание вообще?
				ВидОбъектаНедвижимостиДляЗдания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Здание,"ВидОбъектаНедвижимости");
				Если НЕ ЗначениеЗаполнено(ВидОбъектаНедвижимостиДляЗдания) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан вид объекта недвижимости у здания, выбранного для ДДУ", ЭтотОбъект.Здание, "ВидОбъектаНедвижимости",, Отказ);
				ИначеЕсли ВидОбъектаНедвижимостиДляЗдания <> Перечисления.ВидыОбъектовНедвижимости.Здание Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В сделке ДДУ в качестве здания выбран объект в другим видом ("+ВидОбъектаНедвижимостиДляЗдания+")", ЭтотОбъект, "Здание",, Отказ);
				КонецЕсли;	
				
				//здание д.б. заполнено у всех помещений договора
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОбъектыНедвижимости.Ссылка КАК ОбъектыНедвижимостиСсылка,
					|	ОбъектыНедвижимости.Наименование КАК ОбъектыНедвижимостиНаименование,
					|	ОбъектыНедвижимости.Здание КАК Здание,
					|	ОбъектыНедвижимости.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости
					|ИЗ
					|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
					|ГДЕ
					|	ОбъектыНедвижимости.Ссылка В(&СписокОбъектовНедвижимости)
					|	И (ОбъектыНедвижимости.Здание <> &Здание
					|			ИЛИ ОбъектыНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.Помещение))
					|	И ОбъектыНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ОбъектНезавершенногоСтроительства)";
				
				Запрос.УстановитьПараметр("СписокОбъектовНедвижимости", ЭтотОбъект.ОбъектыНедвижимости.ВыгрузитьКолонку("ОбъектНедвижимости"));
				Запрос.УстановитьПараметр("Здание", ЭтотОбъект.Здание);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.ВидОбъектаНедвижимости <> Перечисления.ВидыОбъектовНедвижимости.Помещение Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид объекта недвижимости " + ВыборкаДетальныеЗаписи.ОбъектыНедвижимостиНаименование + " (" + ВыборкаДетальныеЗаписи.ВидОбъектаНедвижимости + ") не является помещением ", ВыборкаДетальныеЗаписи.ОбъектыНедвижимостиСсылка, "ВидОбъектаНедвижимости",, Отказ);
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Здание) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У помещения " + ВыборкаДетальныеЗаписи.ОбъектыНедвижимостиНаименование + " не указана принадлежность к зданию", ВыборкаДетальныеЗаписи.ОбъектыНедвижимостиСсылка, "Здание",, Отказ);
					ИначеЕсли ВыборкаДетальныеЗаписи.Здание <> ЭтотОбъект.Здание Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У помещения " + ВыборкаДетальныеЗаписи.ОбъектыНедвижимостиНаименование + " указанное здание не совпадает со зданием ДДУ", ЭтотОбъект,,, Отказ);
					КонецЕсли;
					
				КонецЦикла;
	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ЭтотОбъект.Здание) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Здание нужно только для договора ДДУ! Очистите реквизит",ЭтотОбъект,"Здание",,Отказ);
			КонецЕсли;
		КонецЕсли;
			
				
		Если ЭтотОбъект.Изменение Тогда
			
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Основание)  Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана основная сделка с недвижимостью!",ЭтотОбъект,Основание,,Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "Основание"))  Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение может быть создано только для основной сделки!",ЭтотОбъект,Основание,,Отказ);
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	                                                                                         
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
